{"pageProps":{"frontmatter":{"author":"Antony Jr.","title":"Making AppImage for Insight GDB Debugger for Reading a Book on Assembly","description":"How I made an AppImage for Insight GDB Debugger for finishing Step by Step Assembly Book by Jeff Duntemann","image":"/blog-posts-assets/2018-04-24.png","imageCopyright":"Redhat","tag":"AppImage","read":10},"date":"Tue Apr 24 2018","markdownBody":"\nFor a long time I really wanted to study Assembly, just because I like to be close to metal. While some think\nthat abstraction is the key, I perceive things a bit differently. I like abstraction but with atomic understanding about what is being \nabstracted. Like how we study about atoms but we abstract it away when we speak about logic gates.\n\nLike atoms, I really wanted to understand how raw instructions are written and linked.\n\nSo for the basics I bought \"Step by Step Assembly\" by Jeff Duntemann from Amazon. The book arrived soon enough for me to get\nstarted.\n\nI was already a decent software engineer(I hope). So the book was not that hard for me. For the first week I was just reading \neverything, I was not really trying anything out, Because I'm really lazy.\n\nSo one fine day I thought I would give a try on the exercises to test my understanding on the study. As the book stated, it requested\nme to install Ubuntu and then install the packages Kate and Insight GDB Debugger.\n\nI was using Arch linux with KDE Plasma back then(still I'm using the same distro and DE). So Kate was already installed.\nAs for Insight, I searched the Arch linux official repo and with no avail I did not find anything about it. \nThis was not something I've never experienced since Arch linux is kind of make it work yourself. \nSo I tried to compile Insight from source but the problem is that it depends on very old software that is \nonly available in old ubuntu releases.\n\nSo the first thing I thought was compiling this from **Travis-CI**. If you are not familiar with *Travis-CI*, it is a \ncontinuous integration SaaS(Software as a Service) that is **free for open source projects**.\n*Travis-CI* has support for multiple distros and even the old ubuntu stable releases.\n\nMy choice was to use *Ubuntu Trusty Thar* in *Travis-CI*. \n\n\nNow comes the packaging for the compiled binaries, My first choice is of course **AppImages**. AppImage is perfect for this use case because\nwe need to support execution of this binary on most linux distros.\n\nThe hard part was trianging the dependencies of the binaries that was not caught by the ```ldd``` command.\n\n### Learning Tcl/Tk\n\nIf you are not familiar with it, it's a programming language used to describe graphical user interface for the Tkinter library.\nTkinter library is really good(and really old), I've used in the past, like 5 years ago.\n\nI needed to learn some Tcl to search for Insight's(TCL/Tk) libraries dynamically at runtime. My main patch is only a few lines which \nfixes this issue. Without this fix you will not be able to run Insight even if you compile it yourself(unless you put the required tcl files \nat a static location).\n\n\n### Victory after a lot of spam mails from Travis-CI\n\nFinally I was able to download the AppImage from my github releases and try it out. It ran without any trouble this time. But I have \nto admit, It was more fun doing this project than reading the book itself. Because the time spent on this will benefit someone \natleast.\n\nYou can checkout the project at https://github.com/antony-jr/insight\n\n### Reaching out to the Author\n\nI tweeted my AppImage to the Author(*Jeff Duntemann*) as he gave a post on his official website on some hard workarounds for the insight \nproblem. What is the point in solving a problem if no one is going to use it?\n\n```tweet\n989128614137315333\n```\n\nHe replied very soon indeed, and he even tweeted about that to some.\n\n```tweet\n996603976010186752\n```\n\n# Conclusion\n\nIn the end it was fun learning Assembly. I think everyone should learn Assembly before calling themselves a computer wiz.\n","slug":"2018-04-24-making-appimage-for-insight-gdb-debugger","prevPost":null,"nextPost":{"date":"Mon Aug 19 2019","author":"Antony Jr.","title":"Update Deploy Qt: Making updaters for Qt Application with a single command","description":"Future plans for Update Deploy Qt, A project that aims to make updater for Qt Application with less code as possible, ideally with a single command","image":"/blog-posts-assets/2019-08-19.png","tag":"Dev Tools","read":5,"slugName":"2019-08-19-update-deploy-qt-make-updaters-for-qt-applications"}},"__N_SSG":true}