{"pageProps":{"frontmatter":{"author":"Antony Jr.","title":"ShareMyHost for streaming Movies from my Computer to Kodi","description":"My solution on streaming Movies in my local network to my TV with Kodi.","image":"/blog-posts-assets/2019-11-21.png","tag":"Project","read":5},"date":"Thu Nov 21 2019","markdownBody":"\nStreaming anything from one device to another requires a basic network connection. At my home my main computer and my Smart TV\nbuilt using a *Raspberry Pi* is connected to my broadband network. So everything at my home is connected by LAN.\n\nI used to use **http-server**(node module) to stream movies from my computer to my Smart TV but it was kind of hard to use and \nwas not made for streaming movies. Also I had to frequently change directories and to change to different location to stream different \ncontent to my Smart TV.\n\nSo I looked for some solution for this problem. What I wanted was a software which could create HTTP endpoints to specific locations \non my computer.\n\nSurprisingly there was no software that follows my description.\n\nI'm Software Engineer so I built the software I needed. Simple as that. It is worthy to note that I'm not a professional software engineer.\n\n\nI used Mongose server and embeded it into my Qt/QML application **ShareMyHost**. I modified the mongose server source code to use \nhttp mountpoints.\n\nYou can checkout the project at https://github.com/antony-jr/ShareMyHost, If you want to support it please star it.\n\n","slug":"2019-11-21-sharemyhost-for-streaming-movies","prevPost":{"date":"Mon Aug 19 2019","author":"Antony Jr.","title":"Update Deploy Qt: Making updaters for Qt Application with a single command","description":"Future plans for Update Deploy Qt, A project that aims to make updater for Qt Application with less code as possible, ideally with a single command","image":"/blog-posts-assets/2019-08-19.png","tag":"Dev Tools","read":5,"slugName":"2019-08-19-update-deploy-qt-make-updaters-for-qt-applications"},"nextPost":{"date":"Sat Aug 08 2020","author":"Antony Jr.","title":"Buying a Domain with Namecheap","description":"Long awaited task of buying a domain for myself is finally complete.","image":"/blog-posts-assets/2020-08-08.png","imageCopyright":"Namecheap","tag":"Personal","read":5,"slugName":"2020-08-08-buying-a-domain-with-namecheap"}},"__N_SSG":true}