{"pageProps":{"frontmatter":{"author":"Antony Jr.","title":"Securing my Cloud Instance with SSH Control","description":"My take on using my self-made software solution for securing my Cloud Instance","tag":"Security","read":2},"date":"Fri Aug 14 2020","markdownBody":"\nAs you may know, I recently got my cloud instance from Hetzner. The overall security at Hetzner is well made but there is no \n2FA with SMS at Hetzner because of some security hole in SMS based 2FA. \n\nHetzner do provide 2FA with Yubikey(Around $2000) which costs a fortune for poor souls like me. But there is also 2FA with \n**Google Authenticator** or **TOTP** app which can be installed in any Android Phone with zero cost(For TOTP you have pay a extra fee \nto backup your keys). But I don't use Android Phone and I'm pretty sure I will not be using it in the foreseeable future. \nAlso **Google Authenticator is not cloud based so if you lose your phone or if it is broken, Forever you are locked out of your account**.\n\nSo until some TOTP based app is open source and free, I think I will have to wait.\n\nNow the Cloud Dashboard is not the only area you need to secure when hosting a server. There is also **SSH Server**.\nIf someone has your server's IP address they can easily do a brute force attact on your **SSH** login. There are some ways to \nmitigate this, like you can use Public Key Crypto and avoid password logins. But still there is a chance someone can overload your SSH server.\n\nSo to avoid this I was searching for some kind of a switch that can securely turn SSH Server **ON** or **OFF** on my remote server. The \nresult of that was **SSH Control**. It is simple and powerful *Python/Flask* application which can trun ON or OFF your SSH Server remotely \nusing your **GPG Private Key** as authentication.\n\nFor more information please check out the project at https://github.com/antony-jr/ssh-control\n\n\nIn my opinion SSH Control is very secure, I even use it for my cloud instance, When your SSH Server is off, there is no way someone can \nget access to your server even if they have your SSH Private Key. But if they do get their hands on your GPG and SSH Private Key then\nthere is no saving you. That's why you should keep your GPG Private Key in paper prints and not store on any cloud server. Know more about this \n[here](https://en.wikipedia.org/wiki/Paper_key).\n\n\nIf you want to test the security level of my SSH Control program you can try to crack it at ```https://api.antonyjr.in/SSHControl```, if you \ndo manage to crack it, I hope you would open a issue at my project page at https://github.com/antony-jr/ssh-control\n\nI think SSH Control might be useful for you too.\n","slug":"2020-08-14-securing-with-ssh-control","prevPost":{"date":"Mon Aug 10 2020","author":"Antony Jr.","title":"Buying a Cloud Instace from Hetzner is Hard But Worth It","description":"I've bought cloud instances from a lot of vendors but hetzner is the hardest to get","image":"/blog-posts-assets/2020-08-10.png","imageCopyright":"MyBroadband Blog","tag":"Personal","read":5,"slugName":"2020-08-10-buying-a-cloud-instance-from-hetzner"},"nextPost":{"date":"Sun Dec 27 2020","author":"Antony Jr.","title":"🥳 My first patch got accepted into the Linux Kernel 🥳","description":"My first patch to the Linux Kernel recently got merged into the upstream.","tag":"Personal","image":"/blog-posts-assets/2020-12-27.png","imageCopyright":"Kernel.org","read":2,"slugName":"2020-12-27-linux-first-patch-accepted"}},"__N_SSG":true}