{"pageProps":{"frontmatter":{"author":"Antony Jr.","title":"Update Deploy Qt: Making updaters for Qt Application with a single command","description":"Future plans for Update Deploy Qt, A project that aims to make updater for Qt Application with less code as possible, ideally with a single command","image":"/blog-posts-assets/2019-08-19.png","tag":"Dev Tools","read":5},"date":"Mon Aug 19 2019","markdownBody":"\nThis project was tought a very long time ago. I actually thought of using simple *subprocess* to achive this but eventually got a hack to \ndo this without using *subprocess* by directly injecting code into the application's memory and execution cycle(I will talk about this in \nthis post).\n\nInitially I had planned to support the following distribution methods but changed it along the way,\n\n   * Qt Installer Framework and\n   * Github Releases\n\n\nFor these two distribution methods I created the below two projects,\n   \n   * QPluginInstaller (https://github.com/antony-jr/QInstallerBridge)\n   * GHReleasesBridge (Deleted the Repo)\n\nSo after having the entire project at alpha stage, I suggested it to a AppImage developer to use it as their solution for\nupdating their AppImages. But the guys at AppImage said that they needed the Zsync algorithm's way of updating and not my\ndistribution methods. \n\nSo Now that there is some users who want this, I thought I might need to implement this in the future anyway so I started working \non the bridge **for updating AppImages using the Zsync Algorithm**. After finishing that I created the beta version of \nupdatedeployqt. \n\nIt initially gained support from some Qt projects. But some were skeptical because there were less stars on the project.\n\nIf you want to support the project then please star it at https://github.com/antony-jr/updatedeployqt\n\n\n![issue](/blog-posts-assets/updatedeployqtissue.png)\n\n**I have put the project on pause because the code injection did not seem to work well Qt/QML projects. But Now I've finally discovered\non how to do that but I'm really really lazy on implementing it.**\n\n### Note About Code Injection\n\nSimilar to Games, Qt uses a plugin system which loads shared libraries on runtime. One such shared library is Qt's basic core plugin for\neach platform. I recompiled that specific plugin with my custom code to load my bridges according to the configuration given in json\nformat by the user. Now when a Qt Application is deployed the actual Qt core plugin is replaced with my mod Qt core plugin.\n\nThis gives my bridges to execute within the target program's memory.\n\n### Conclusion\n\nI'm really planning to revive this project as soon as possible but a lot of things are more important in life than some hobby \nproject, So hopefully in the near future(maybe 2023 or 2024) the project might be in stable release. \n","slug":"2019-08-19-update-deploy-qt-make-updaters-for-qt-applications","prevPost":{"date":"Tue Apr 24 2018","author":"Antony Jr.","title":"Making AppImage for Insight GDB Debugger for Reading a Book on Assembly","description":"How I made an AppImage for Insight GDB Debugger for finishing Step by Step Assembly Book by Jeff Duntemann","image":"/blog-posts-assets/2018-04-24.png","imageCopyright":"Redhat","tag":"AppImage","read":10,"slugName":"2018-04-24-making-appimage-for-insight-gdb-debugger"},"nextPost":{"date":"Thu Nov 21 2019","author":"Antony Jr.","title":"ShareMyHost for streaming Movies from my Computer to Kodi","description":"My solution on streaming Movies in my local network to my TV with Kodi.","image":"/blog-posts-assets/2019-11-21.png","tag":"Project","read":5,"slugName":"2019-11-21-sharemyhost-for-streaming-movies"}},"__N_SSG":true}